ПредопределенныеЗначенияПодсистема/src/DataProcessors/ПредопределенныеНастройкиТестирование/ПредопределенныеНастройкиТестирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПредопределенныеНастройкиТестирование</name>
</mdclass:DataProcessor>

ПредопределенныеЗначенияПодсистема/src/Catalogs/ПредопределенныеНастройки/ПредопределенныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПредопределенныеНастройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенияПредопределенныхЗначений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПредопределенныеЗначенияПодсистема/src/DataProcessors/ПредопределенныеНастройкиТестирование/Forms/Форма/Module.bsl
// Обработка создания, проверки и удаления предопределенных настроек для подсистемы ПредопределенныеЗначения.

// Процедура выполняется при создании формы на сервере.
// Параметры:
// - Отказ - логическое значение, указывающее на отмену действия. Если в процедуре установлено Истина, то стандартное действие будет прервано.
// - СтандартнаяОбработка - логическое значение, если Истина, то выполнится стандартная обработка события.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьСозданныеНастройки();
	ОбновитьПовторноИспользуемыеЗначения();
	ПроверитьУдаленныеНастройки();
	
КонецПроцедуры

#Область ОбработчикиКомандФормы


// Процедура вызывается при выполнении команды создания предопределенных настроек.
// Параметры:
// - Команда - объект, представляющий команду.
&НаКлиенте
Процедура СозданиеПредопределенныхНастроек(Команда)

    СозданиеПредопределенныхНастроекНаСервере();

КонецПроцедуры

// Процедура вызывается при выполнении команды удаления предопределенных настроек.
// Параметры:
// - Команда - объект, представляющий команду.
&НаКлиенте
Процедура УдалениеПредопределенныхНастроек(Команда)

	ОбновитьПовторноИспользуемыеЗначения();
    УдалениеПредопределенныхНастроекНаСервере();
    ОбновитьПовторноИспользуемыеЗначения();
    ПроверитьУдаленныеНастройки();
    
КонецПроцедуры

#КонецОбласти

#Область СерверныеМетоды

// Процедура выполняет создание предопределенных настроек на сервере.
&НаСервере
Процедура СозданиеПредопределенныхНастроекНаСервере()


    ОбновитьПовторноИспользуемыеЗначения();
		ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
    ПредопределенныеНастройки.ЗаполнениеПредопределенныхЭлементов(ТаблицаНастроек);
КонецПроцедуры

// Функция возвращает таблицу предопределенных тестовых настроек.
// Возвращаемое значение:
// ТаблицаЗначений - ТаблицаЗначений, содержащая информацию о предопределенных тестовых настройках.
&НаСервере
Функция ТаблицаПредопределенныхТестовыхНастроек()

    ТаблицаНастроек = ПредопределенныеНастройки.ТаблицаПредопределенныхНастроек();
    НоваяНастройка = ТаблицаНастроек.Добавить();
    НоваяНастройка.Идентификатор = Новый УникальныйИдентификатор("2f205348-2c73-46a8-98a6-851a40a12bbe");
    НоваяНастройка.ИмяНастройки = "ТестированиеСтроковогоЗначения";
    НоваяНастройка.ЗначениеПараметров = "Строковое значение";
    Возврат ТаблицаНастроек;

КонецФункции

// Процедура проверяет, были ли созданы предопределенные настройки.
&НаСервере
Процедура ПроверитьСозданныеНастройки()

    НастройкиНайдены = Истина;
    ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();
    
    Для Каждого Строка Из ТаблицаНастроек Цикл
        Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);
        Если Настройка = ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
            НастройкиНайдены = Ложь;
        КонецЕсли;
    КонецЦикла;

    Если НастройкиНайдены Тогда 
        Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
        Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки созданы'");
    Иначе
        Элементы.НастройкиСозданы.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
        Элементы.НастройкиСозданы.Подсказка = НСтр("ru ='Тестовые настройки не найдены'");
    КонецЕсли;

КонецПроцедуры

// Процедура удаляет предопределенные настройки с сервера.
&НаСервере
Процедура УдалениеПредопределенныхНастроекНаСервере()

    ОбновитьПовторноИспользуемыеЗначения();
    ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();

    Для Каждого Строка Из ТаблицаНастроек Цикл
        Настройка = ПредопределенныеНастройкиПовтИсп.СсылкаПредопределеннойНастройки(Строка.ИмяНастройки);
        Если ЗначениеЗаполнено(Настройка) И ТипЗнч(Настройка) = Тип("СправочникСсылка.ПредопределенныеНастройки") Тогда
            ОбъектНастройки = Настройка.ПолучитьОбъект();
            ОбъектНастройки.Удалить();
        КонецЕсли;
    КонецЦикла;

КонецПроцедуры

// Процедура проверяет, были ли удалены предопределенные настройки.
&НаСервере
Процедура ПроверитьУдаленныеНастройки()

    НастройкиУдалены = Истина;
    ТаблицаНастроек = ТаблицаПредопределенныхТестовыхНастроек();

    Для Каждого Строка Из ТаблицаНастроек Цикл
        Настройка = ПредопределенныеНастройки.Значение(Строка.ИмяНастройки);
        Если Настройка <> ПредопределенноеЗначение("Справочник.ПредопределенныеНастройки.ПустаяСсылка") Тогда
            НастройкиУдалены = Ложь;
        КонецЕсли;
    КонецЦикла;

    Если НастройкиУдалены Тогда 
        Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
        Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки не обнаружены'");
    Иначе
        Элементы.НастройкиУдалены.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
        Элементы.НастройкиУдалены.Подсказка = НСтр("ru ='Тестовые настройки найдены в базе'");
    КонецЕсли;

КонецПроцедуры
#КонецОбласти
